In [1]:
from src.classes.DataLoader import DataLoader
from src.constants.path import LOAD_DATA_PATH
import pandas as pd
import numpy as np
from src.constants.scheme import COLUMNS

In [2]:
LOAD_DATA_PATH

'/home/fernandofincatti/Documents/personal-projects/streamlit-financial-dash/src/data/'

In [5]:
df = pd.read_csv(f'{LOAD_DATA_PATH}transaction-history-clean.csv')

In [6]:
df.category.value_counts()

unknown             197
market              131
restaurant           39
shop                 30
transport            26
accommodation        11
pharmacy             10
rent                  7
entertainment         5
health_insurance      4
tax                   3
internet              1
Name: category, dtype: int64

In [7]:
df.head()

,transfer_number,status,direction,start_date,end_date,origin_tariff_value,origin_tariff_currency,destiny_tariff_value,destiny_tariff_currency,name_origin,...,exchange_rate,reference,lot,is_transfer,balance_conversion,year,month,day,beneficiary,category
0,TRANSFER-786503674,COMPLETED,OUT,2023-08-28 18:47:51,2023-08-28 18:48:07,0.0,EUR,NaN,NaN,Fernando Cesar Furtado Ballesteros Fincatti,...,1.0,NaN,NaN,True,False,2023,August,28,Paulo Rafael Alberton Bloemer,unknown
1,CARD_TRANSACTION-907997992,COMPLETED,OUT,2023-08-28 11:28:41,2023-08-28 11:28:41,0.0,EUR,NaN,NaN,Fernando Cesar Furtado Ballesteros Fincatti,...,1.0,NaN,NaN,False,False,2023,August,28,Woolworth,shop
2,TRANSFER-785803566,COMPLETED,IN,2023-08-28 07:39:48,2023-08-28 07:41:47,0.0,EUR,NaN,NaN,FERNANDO CESAR FURTADO BALLESTEROS FINCATTI,...,1.0,Expatrio M1,NaN,True,False,2023,August,28,Fernando Cesar Furtado Ballesteros Fincatti,unknown
3,CARD_TRANSACTION-907007542,COMPLETED,OUT,2023-08-27 19:32:43,2023-08-27 19:32:43,0.0,EUR,NaN,NaN,Fernando Cesar Furtado Ballesteros Fincatti,...,1.0,NaN,NaN,False,False,2023,August,27,Basta Pasta Side,restaurant
4,CARD_TRANSACTION-904725333,COMPLETED,OUT,2023-08-26 15:21:43,2023-08-26 15:21:43,0.0,EUR,NaN,NaN,Fernando Cesar Furtado Ballesteros Fincatti,...,1.0,NaN,NaN,False,False,2023,August,26,EDEKA,market

In [12]:
df.columns

Index(['transfer_number', 'status', 'direction', 'start_date', 'end_date',
       'origin_tariff_value', 'origin_tariff_currency', 'destiny_tariff_value',
       'destiny_tariff_currency', 'name_origin', 'origin_amount',
       'origin_currency', 'beneficiary_name', 'destiny_amount',
       'destiny_currency', 'exchange_rate', 'reference', 'lot', 'is_transfer',
       'balance_conversion', 'year', 'month', 'day', 'beneficiary',
       'category'],
      dtype='object')

In [29]:
s = df.groupby('category')['origin_amount'].sum().reset_index()
s.sort_values('origin_amount', ascending=False)

            category  origin_amount
11           unknown      175898.76
6               rent        4400.00
4             market        1530.77
8               shop         884.75
10         transport         614.34
2   health_insurance         539.43
9                tax         345.52
7         restaurant         328.15
0      accommodation         268.41
5           pharmacy          88.69
1      entertainment          69.29
3           internet          10.00

In [25]:
n = df.groupby(['category', 'month'])["origin_amount"].sum().reset_index()
n.groupby('category')["origin_amount"].mean().reset_index()

            category  origin_amount
0      accommodation      89.470000
1      entertainment      34.645000
2   health_insurance     134.857500
3           internet      10.000000
4             market     255.128333
5           pharmacy      14.781667
6               rent     733.333333
7         restaurant      54.691667
8               shop     147.458333
9                tax     172.760000
10         transport     153.585000
11           unknown   21987.345000

In [24]:
n.query('category == "transport"')

     category   month  origin_amount
42  transport  August         245.09
43  transport    July         216.40
44  transport    June          49.00
45  transport     May         103.85